TestPlans/Car/Sure Thing! Max/xml/STM3_15102014_8.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <tns:aggregateQuoteRequest xmlns:tns="http://schemas.cdlis.co.uk/aggregator/api/v3-8">
      <userid>CTM</userid>
      <password>tys82HS63BjS</password>
      <broker results="1">hastings-dir</broker>
      <broker results="1">hastings-ess</broker>
      <broker results="1">igi3</broker>
      <broker results="1">onequote</broker>
      <broker results="1">elite</broker>
      <broker results="1">virgin</broker>
      <broker results="1">esurebroker</broker>
      <broker results="1">sheilasbroker</broker>
      <broker results="1">hastings-prem</broker>
      <broker results="1">hastings-peoples</broker>
      <broker results="1">selecter-oyd</broker>
      <broker results="1">sagaselect</broker>
      <broker results="1">smartmiles</broker>
      <broker results="1">castlecover-ageas50</broker>
      <broker results="1">surething</broker>
      <broker results="1">igo4asp-santander</broker>
      <broker results="1">igo4asp-renault</broker>
      <broker results="1">insurewiser</broker>
      <broker results="1">coverbox</broker>
      <broker results="1">drivestyle</broker>
      <broker results="1">sheilaswheelsmd</broker>
      <broker results="1">SureThing-Max</broker>
      <policyType>PC</policyType>
      <returnNoQuotes>Y</returnNoQuotes>
      <store>true</store>
      <risk xsi:type="tns:privateCarRiskType">
        <policy>
          <inceptionDate>2014-10-29</inceptionDate>
          <frequency>A</frequency>
          <protectedBonus>N</protectedBonus>
          <cover>C</cover>
          <volXS>200</volXS>
          <restrict>ND</restrict>
          <previousInsurance>
            <expiryDate>2014-10-29</expiryDate>
            <yearsHeld>0</yearsHeld>
            <type>PC</type>
            <noClaimsBonusYears>8</noClaimsBonusYears>
            <ncbProtected>N</ncbProtected>
          </previousInsurance>
          <totalMileage>2000</totalMileage>
          <classOfUse>SDP</classOfUse>
        </policy>
        <proposer driverId="1">
          <name>
            <title>Mr</title>
            <forenames>Henry</forenames>
            <surname>Eight</surname>
          </name>
          <gender>M</gender>
          <dateOfBirth>1974-08-20</dateOfBirth>
          <maritalStatus>W</maritalStatus>
          <residentSince>1974-08-20</residentSince>
          <insuranceRefused>N</insuranceRefused>
          <nonRtaConviction>N</nonRtaConviction>
          <fullTimeOccupation>
            <type>U</type>
            <occCode>U03</occCode>
            <empCode>186</empCode>
          </fullTimeOccupation>
          <claim claimId="1">
            <code>M102</code>
            <date>2010-01-01</date>
            <cost>0.00</cost>
            <thirdPartyCost>0</thirdPartyCost>
            <fault>Y</fault>
            <personalInjury>Y</personalInjury>
            <thisPolicy>N</thisPolicy>
          </claim>
          <licence>
            <type>E</type>
            <date>2006-10-15</date>
          </licence>
          <vehicleUse>F</vehicleUse>
          <accessToOtherVehicles>NAOV</accessToOtherVehicles>
          <motoringOrg>NONE</motoringOrg>
          <smoker>Y</smoker>
          <address>
            <addressLine1>174 Partington Lane</addressLine1>
            <addressLine2>Swinton</addressLine2>
            <addressLine3>Manchester</addressLine3>
            <addressLine4></addressLine4>
            <postCode>M27 0WN</postCode>
            <abodeType>H</abodeType>
          </address>
          <daytimeTelephone>01733345678</daytimeTelephone>
          <eveningTelephone>01733345678</eveningTelephone>
          <email>oliver.neal@emailreaction.org</email>
        </proposer>
        <driver driverId="2">
          <name>
            <title>Mrs</title>
            <forenames>Helen</forenames>
            <surname>Eight</surname>
          </name>
          <gender>F</gender>
          <dateOfBirth>1983-01-11</dateOfBirth>
          <maritalStatus>M</maritalStatus>
          <residentSince>1983-01-11</residentSince>
          <insuranceRefused>N</insuranceRefused>
          <nonRtaConviction>N</nonRtaConviction>
          <fullTimeOccupation>
            <type>E</type>
            <occCode>157</occCode>
            <empCode>413</empCode>
          </fullTimeOccupation>
          <claim claimId="2">
            <code>V001</code>
            <date>2011-03-01</date>
            <cost>0.00</cost>
            <thirdPartyCost>0</thirdPartyCost>
            <fault>Y</fault>
            <personalInjury>N</personalInjury>
            <thisPolicy>N</thisPolicy>
          </claim>
          <licence>
            <type>A</type>
            <date>2010-10-15</date>
          </licence>
          <vehicleUse>M</vehicleUse>
          <accessToOtherVehicles>NAOV</accessToOtherVehicles>
          <relationshipToProposer>N</relationshipToProposer>
        </driver>
        <vehicle>
          <regNumber>R974LGH</regNumber>
          <abiCode>04060903</abiCode>
          <yearOfManufacture>1997</yearOfManufacture>
          <whereKept>R</whereKept>
          <keeper>N</keeper>
          <owner>Company</owner>
          <purchased>2013-01-01</purchased>
          <value>6000</value>
          <paid>6000</paid>
          <vehicleOthers>0</vehicleOthers>
          <LHD>Y</LHD>
          <ABS>N</ABS>
          <seats>2</seats>
          <modifications>
            <modified>N</modified>
          </modifications>
          <immob>FF93</immob>
          <alarm>FACT</alarm>
          <tracker>NONE</tracker>
        </vehicle>
        <duqs>
          <question number="11">N</question>
          <question number="15">Y</question>
          <question number="190">2010</question>
          <question number="266">M</question>
          <question number="40">HOME</question>
          <question number="579" />
          <question number="580"></question>
          <question number="578">N</question>
          <question number="282">I</question>
          <question number="527">Y</question>
          <question number="675">N</question>
          <question number="544">Y</question>
        </duqs>
      </risk>
      <brokerOptionalExtensions>
        <brokerOptionalExtension>
          <type>Premier Mandatory Bundle</type>
        </brokerOptionalExtension>
      </brokerOptionalExtensions>
    </tns:aggregateQuoteRequest>
  </soap:Body>
</soap:Envelope>